Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsOffset Property
 "Dimension Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsOffset { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsOffset {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthDimensionsOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace